from Input.BaseInputTab import BaseInputTab


class IntInputTab(BaseInputTab):

    def __init__(self, parent=None):
        super().__init__("INT Input Регистры", parent)
        self.create_int_registers()

    def create_int_registers(self):
        int_registers = [
            ("Состояние кондиционера", 1, "int16"),
            ("Вентиляторы испарителя", 6, "int16"),
            ("Дней до обслуживания", 15, "int16"),
            ("Аварийное реле", 18, "int16"),
            ("Авария датчика ТХК", 19, "int16"),
            ("Авария датчика ТГК", 20, "int16"),
            ("Авария датчика Т вода вход", 21, "int16"),
            ("Авария датчика Т вода выход", 22, "int16"),
            ("Авария потока воздуха", 23, "int16"),
            ("Задымление", 24, "int16"),
            ("Авария связи c CleverView", 25, "int16"),
            ("Авария обслуживания", 26, "int16"),
            ("Авария температуры", 27, "int16"),
            ("Авария помпы дренажа", 28, "int16"),
            ("Дверь передняя стойка левая", 45, "int16"),
            ("Дверь задняя стойка левая", 46, "int16"),
            ("Дверь левая верхняя", 47, "int16"),
            ("Дверь левая нижняя", 48, "int16"),
            ("Дверь правая верхняя", 49, "int16"),
            ("Дверь правая нижняя", 50, "int16"),
            ("Дверь фанкойл передняя", 51, "int16"),
            ("Дверь фанкойл задняя", 52, "int16"),
            ("Дверь задняя стойка правая", 69, "int16"),
            ("Дверь передняя стойка правая", 70, "int16"),
            ("Авария Влажности", 71, "int16"),
            ("% открытия клапана", 72, "int16"),
            ("Количество аварий", 73, "int16"),
            ("Авария Т воды", 86, "int16"),
            ("Предупреждение температура", 87, "int16"),
            ("Предупреждение влажность", 88, "int16"),
            ("Предупреждение Т воды", 89, "int16")
        ]

        for name, address, data_type in int_registers:
            self.add_register(name, address, data_type)

    def renew_data(self):
        print("Int Input Tab Class!")